function solve () {

    let arr =[1, 2, 3, 4, 5];
    console.log(arr);
    console.table (arr);
    console.log(arr[0]);
    console.log(arr.length);

    arr[6] = arr[0] + arr[1] // на 6ти индекс добавяме сбор. Можем да добавим и цяло число. Те остават на номера индекс, който сме задали
    console.log(arr.length); // Показва ни, че на 5ти индекс остава дупка.
    console.table(arr); 
    console.log(arr[6]);

    arr.push(10); // добавя елемент на последната възможна позиция на индексите.
   // .length // дължина
   // .push // внедравяне на елемент на последно място в масив
   // .includes // Проверява дали определено число се съдържа в масива true/false
   // .toString // преобразува в стринг целия масив (или каквото и да е)
   // .join // съединява всички елементи в масива с някой от сепараторите (-, +, :, ; и т.н.).Ако не сложим нищо в скобите съединява с , и го върти в стринг
   // for (let el of arr) - присвоява първия елемент от масива и започва да върти цикъл по него. 

    




}
solve ()