let arr = [1, 2, 3, 4]
console.log(arr.fill(0, 2, 4)); //запълва масива от втори до 4ти индекс с 0.
console.log(arr.fill(3,1)); // запълва масива от първи индекс до края с 3.
console.log(arr.fill(6)); //запълва целия масив с 6.
console.log(arr.some(x => x > 3)); // Връща резултат дали някое от числата е по-голямо от зададеното. Ако само едно отговаря на условието, връща true/false.
console.log(arr.every(x => x > 6)); // Връща резултат ако всички резултати отговарят на условието. true/false
console.log(arr.find(x => x > 3)); // Връща стойноста, която отгваря на условието.
console.log(arr.findIndex(x => x > 3)); // Връща първия индекс, който отгваря на условието.
console.log(arr.filter(x => x % 4)); // Връща масив с премахнати елементи, които отговарят на условието.

//filter винаги ползва 3 параметъра (value, index, array). Ако искаме да достъпим индекса трябва да зададем x, i.
console.log(arr);